{
  "main": {
    "name": "Vishal Maurya",
    "occupation": "Game Developer",
    "description": "",
    "image": "MyProfilePic.jpg",
    "bio": "I am a professional game developer with extensive experience and expertise in gameplay optimization, UI, multiplayer, and gameplay mechanics. After developing various hypercasual games for over 3 years in my weekend projects and industrial experiences, I am exploring oppurtunities in game development for AAA titles and Indie games. Academically, I am a fourth year undergraduate student of Physics major at IIT Kharagpur, where  i enjoy strolling around the campus and participating in various vibrant events whenever I am not developing games or vested in exams.",
    "contactmessage": "Get in touch with me to make awesome games!",
    "email": "mauryav2002@gmail.com",
    "phone": "",
    "address": {
      "city": "Mumbai",
      "state": "Maharashtra"
    },
    "website": "",
    "resumedownload": "./images/portfolio/Resume_Vishal.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/vishal.maurya.7503314",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/vishal-maurya-94157b1a2",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Mvishal2002",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My Programming Language and Game Engines Proficiency",
    "education": [
      {
        "school": "Indian Institute Of Technology Kharagpur, India",
        "degree": "Integrated M.Sc Degree, Physics",
        "graduated": "July 2019 - Current, Fourth Year",
        "description": "Current CGPA 8.43/10"
      }
    ],
    "work": [
      {
        "company": "Supergaming",
        "title": "Game Developer Intern",
        "years": "May 2022 - July 2022",
        "description": "As a Game Developer Intern at Tower Conquest: Metaverse, I brought my expertise in implementing gameplay features using Finite State Machines and resolved bugs related to synchronization and parameters. I integrated with back-end server APIs and designed UI screens for PvE and PvP game modes. This internship taught me the ins and outs of game development while working on a cutting-edge Web3-based game."
      },
      {
        "company": "Wizwack Studios",
        "title": "Unity Game Developer Intern",
        "years": "November 2021 - January 2022",
        "description": "As a game development intern, I implemented multiplayer features in StarHunt using Firebase and added rewarded ads to Fight-Back with Android SDK and AdMobs. I also designed and developed Giant-Runner's gameplay, UI, and levels. Through these projects, I gained experience in Firebase, AdMobs, and game development, honing my skills in Unity, C#, and mobile development."
      }
    ],
    "skills": [
      {
        "name": "Unity",
        "level": "100%",
        "image": "./images/UnityLogo.png"
      },
      {
        "name": "Unreal",
        "level": "60%",
        "image": "./images/UnrealLogo.png"
      },
      {
        "name": "C",
        "level": "90%",
        "image": "./images/CLogo.png"
      },
      {
        "name": "Python",
        "level": "75%",
        "image": "./images/PythonLogo.png"
      },
      {
        "name": "C++",
        "level": "85%",
        "image": "./images/C++Logo.png"
      },
      {
        "name": "C#",
        "level": "85%",
        "image": "./images/CsharpLogo.png"
      },
      {
        "name": "Javascript",
        "level": "70%",
        "image": "./images/JSLogo.png"
      },
      {
        "name": "VS Code",
        "level": "70%",
        "image": "./images/VSLogo.png"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Balance | Unity",
        "category": "Game Jam",
        "image": "GameJam.png",
        "url": "https://github.com/Mvishal2002/Balance-Unity",
        "content": "Get ready for heart-pumping excitement with my timer-based game, where players maintain gas levels by tapping on bubbles. My WebGL build ranking 69th among 600+ participants is published on itch.io, showcasing my skills in game development and problem-solving under tight deadlines. Experience the thrill at https://mvishal2002.itch.io/balance and get ready to feel the rush!"
      },
      {
        "title": "Unarmed | Unity",
        "category": "Self Project",
        "image": "Unarmed.png",
        "url": "https://github.com/Mvishal2002/Unarmed-Unity",
        "content": "Presenting my action-packed game where enemies spawn one after another to kill the player having limited ammo. I programmed the AI movement using Nav Mesh and ensured that the player receives new weapons whenever ammo runs out. I designed various shaders and particle effects in Unity, and integrated SFX to give the game an elegant look. With this project, I've showcased my expertise in game programming and design."
      },
      {
        "title": "HummingBirds | Unity",
        "category": "Self Project",
        "image": "HummingBirds.png",
        "url": "https://github.com/Mvishal2002/HummingBirds",
        "content": "Get ready for some intense competition! I designed and trained an AI agent to take on players in a mini-game using Unity ML-Agents and Python. Players compete against AI to gain as much nectar from flowers around them with time against their side. Through this project, I gained expertise in designing and training agents, using Multi-Layer Perceptron structure, and analyzing training results using TensorBoard."
      },
      {
        "title": "Flying Rick | Unreal",
        "category": "Self Project",
        "image": "Runner.png",
        "url": "https://github.com/Mvishal2002/Flying-Rick",
        "content": "Run for your life in my hypercasual endless runner game! Developed using Unreal Engine and C++, the game features various obstacles and powerups to keep you on your toes. Through this project, I gained expertise in level designing, behavior trees, and using blueprints and C++ together. I also designed the UI for the main menu, game, and game end screens, and added stylish SFX to enhance the experience."
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Vishal has demonstrated his skills with self motivation to learn new skills. He exceeded our expectations and completed his projects on time.",
        "user": "Ankit Gupta"
      }
    ]
  }
}